class Car:
    """ Класс автомобіля із функціями """
    def __init__ (self, model, year, color, fuel_loss_100, mileage): # функція ініціалізації змінних класу
        self.model = model
        self.year = year
        self.color = color
        self.fuel_loss_100 = fuel_loss_100
        self.mileage = mileage

    def info(self): # Функція виводу загальної інформації
        print(f"Марка автомобіля: {self.model}. Рік випуску: {self.year}. Колір: {self.color}. Розхід палива на 100 кm: {self.fuel_loss_100}. Пробіг: {self.mileage}")

    def mileage_up(self, increase): # Функція збільшення пробігу
        if increase < 0: # Умова щоб не зменшувати прибіг
            print("Ви намагаєтесь скрутити пробіг. Так робити не можна")

        elif increase < 15000: # Умова додавання пробігу до 15 000км (без збільшення розходу топлива)
            self.mileage += increase

        else: # Інша випадки коли збільшуємо пробіг більше чим 15 000км
            rest = increase % 15000 # Получаємо остачу від ділення на 15000 щоб додати після збільшеня розходу палива
            phases = increase // 15000 # Дізнаємось скільки проміжутків по 15000км пробігу ми додаємо

            for i in range(phases): # проходимось по кожному проміжутку
                self.fuel_loss_100 += (self.fuel_loss_100 / 100) * 10 # правильно збільшуємо розхід топлива (з 1 ітерацією на 10%)
                self.mileage += 15000 # Додаємо пробіг

            self.mileage += rest # додаємо остачу пробігу
        
    def amount_fuel(self, distance):  # функція підрахунку витрати палива на дорогу
        number = (distance / 100) * self.fuel_loss_100 # дистанцію ділимо на 100 щоб дізнатись точну цифру у літраї
        print(f"На дорогу відстаню {distance}км прийдеться витратити {number}л палива")

    def travel_time(self, distance, meddle_speed):  # функція підрахунку витрати часу на дорогу
        travel_time = distance / meddle_speed # ділимо дистанцію (у км) на середню швидкість (у км/год) і получаємо години
        print(f"На дорогу відстаню {distance}км прийдеться витратити {travel_time} годин")
    
c = Car("Toyota Camry", 2008 ,"Чорний" , 10 , 340000) # Створюємо екземпляр класу і ініціалізуємо основні дані
c.info() # Виводимо інформацію
c.mileage_up(35000) # Збільшуємо пробіг на 35 000км
c.info() # Виводимо інформацію після збільшення пробігу
c.amount_fuel(5000) # Дізнаємось скільки палива витратимо на дорогу відстаню 5 000 км
c.travel_time(5000, 80) # Дізнаємось скільки часу витратимо на дорогу відстаню 5 000 км якщо будемо їхати у середньому 80км/год